# **Working With Date And Time**

Python has a module named datetime to work with dates and times.

In this tutorial, we will cover python datetime module and how it is used to handle date, time and datetime formatted variables.
Datetime is a common data type in data science projects.

In [1]:
import numpy as np
import datetime

Let's see what is inside datetime

In [2]:

print(dir(datetime))

['MAXYEAR', 'MINYEAR', '__builtins__', '__cached__', '__doc__', '__file__', '__loader__', '__name__', '__package__', '__spec__', 'date', 'datetime', 'datetime_CAPI', 'sys', 'time', 'timedelta', 'timezone', 'tzinfo']

## Print today's date

In [3]:
date_object = datetime.date.today() #use today() for today's date
print(date_object)

2022-09-06

we can see from the above the current date being printed out for us

In [4]:
datetime_object = datetime.datetime.now()
datetime_object

datetime.datetime(2022, 9, 6, 20, 31, 16, 617648)

Here, we have imported datetime module using import datetime statement.

One of the classes defined in the datetime module is **datetime class**. We then used **now()** method to create a datetime object containing the **current local date** and **time**.

## **Extract current Day, Month and Year**

In [5]:
date = datetime.datetime.now() #use now() for today's date and current time
# Date
print('Current Date is:',date)

# year
print('Year :',date.year)

# month
print('Month:',date.month)

# day
print('Day of Month :',date.day)

Current Date is: 2022-09-06 20:31:44.324633
Year : 2022
Month: 9
Day of Month : 6

## Extract Current Date, Hour, Minute, Seconds and Microseconds

In [6]:
time = datetime.datetime.today()
print('Current Date is:',time)

# hour
print('Hour :',time.hour)

# minute
print('Minute :',time.minute)

# second
print('Second :',time.second)

# microsecond
print('Microsecond :',time.microsecond)

Current Date is: 2022-09-06 20:32:47.532934
Hour : 20
Minute : 32
Second : 47
Microsecond : 532934

## Updating old Dates

In [7]:
date=datetime.datetime.now()
# date
print('Current Date is:',date)

# time
print('Time :',date.time())

# new datetime
print('New datetime :',date.replace(day=10))

Current Date is: 2022-09-06 20:33:44.082077
Time : 20:33:44.082077
New datetime : 2022-09-10 20:33:44.082077

# **Datetime.timedelta**

A timedelta object can be used when for instance, you want to find the difference between two datetime objects.Example, to find the difference between August 4th, 1990 and August 4th, 2021

In [8]:
delta = datetime.datetime(2021, 8, 4) - datetime.datetime(1990, 8, 4)
delta

datetime.timedelta(days=11323)

In [9]:
print('Days :',delta.days)

print('Years :',np.round(delta.days/360))

Days : 11323
Years : 31.0

## Time duration in seconds

In [10]:
t = datetime.timedelta(days = 7, hours = 2, seconds = 15, microseconds = 613410)
print("total seconds =", t.total_seconds())

total seconds = 612015.61341

## Time duration in days

In [17]:
t = datetime.timedelta(days = 7, hours = 2, seconds = 15, microseconds = 613410)
print("total days =", t.days)

total days = 7

## Check If It Is Leap Year

In [18]:
import calendar
calendar.isleap(2020)

True

In [19]:
calendar.isleap(2021)

False

## **Extract Weekday from DateTime**

Extracting Weekday is very helpful in feature engineering, for instance the your target variable can be dependent on the day of the week, like sales of a product are generally higher on a weekend.

The **weekday()** method returns an integer value for the day of the week, where Monday is 0 and Sunday is 6. We can also use the **isoweekday()** to return the weekday value between 1 and 7, just like in real-world scenario.

In [21]:
date=datetime.datetime.now()
# week starts from 0
print('Today is Sunday and it is representedby weekday as:',date.weekday()) # output 2 for Wednesday

# # week starts with 1
print('Today is Sunday and it is represented by isoweekday as:',date.isoweekday()) # output 3 in ISO format for Wednesday

Today is Sunday and it is representedby weekday as: 1
Today is Sunday and it is represented by isoweekday as: 2

### Extract What Week is it in the Year

We can use the **isocalendar()** to get the week of the year.

The **isocalendar()** function return a 3-tuple containing: **ISO year**, **week number**, and **weekday** for the given Timestamp object

In [23]:
date=datetime.datetime.now()
# retuns year, week number, week day
print(date.isocalendar())
print('Week :',date.isocalendar()[1])

(2022, 36, 2)
Week : 36

## **Generate Calender Of The Year**

In [26]:
import calendar
print(calendar.calendar(2022))

                                  2022

      January                   February                   March
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
                1  2          1  2  3  4  5  6          1  2  3  4  5  6
 3  4  5  6  7  8  9       7  8  9 10 11 12 13       7  8  9 10 11 12 13
10 11 12 13 14 15 16      14 15 16 17 18 19 20      14 15 16 17 18 19 20
17 18 19 20 21 22 23      21 22 23 24 25 26 27      21 22 23 24 25 26 27
24 25 26 27 28 29 30      28                        28 29 30 31
31

       April                      May                       June
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
             1  2  3                         1             1  2  3  4  5
 4  5  6  7  8  9 10       2  3  4  5  6  7  8       6  7  8  9 10 11 12
11 12 13 14 15 16 17       9 10 11 12 13 14 15      13 14 15 16 17 18 19
18 19 20 21 22 23 24      16 17 18 19 20 21 22      20 21 22 23 24 25 26
25 26 27 28 29 30         23 24 25 26 27 28 29      27 28 29 30
                          30 31

        July                     August                  September
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
             1  2  3       1  2  3  4  5  6  7                1  2  3  4
 4  5  6  7  8  9 10       8  9 10 11 12 13 14       5  6  7  8  9 10 11
11 12 13 14 15 16 17      15 16 17 18 19 20 21      12 13 14 15 16 17 18
18 19 20 21 22 23 24      22 23 24 25 26 27 28      19 20 21 22 23 24 25
25 26 27 28 29 30 31      29 30 31                  26 27 28 29 30

      October                   November                  December
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
                1  2          1  2  3  4  5  6                1  2  3  4
 3  4  5  6  7  8  9       7  8  9 10 11 12 13       5  6  7  8  9 10 11
10 11 12 13 14 15 16      14 15 16 17 18 19 20      12 13 14 15 16 17 18
17 18 19 20 21 22 23      21 22 23 24 25 26 27      19 20 21 22 23 24 25
24 25 26 27 28 29 30      28 29 30                  26 27 28 29 30 31
31

### Print Calender For Specific Month

In [28]:
print(calendar.month(2023,8))

    August 2023
Mo Tu We Th Fr Sa Su
    1  2  3  4  5  6
 7  8  9 10 11 12 13
14 15 16 17 18 19 20
21 22 23 24 25 26 27
28 29 30 31

# **Python format datetime**

## format()

Use **fomat()** to define your own date format

In [29]:
datetime.date.today().__format__('%Y/%m/%d')

'2022/09/06'

In [30]:
datetime.date.today().__format__('%d/%m/%Y')

'06/09/2022'

# **DateTime Formatting with Strptime & Strftime**

The way date and time is represented may be different in different places, organizations etc. It's more common to use *mm/dd/yyyy* in the **US**, whereas *dd/mm/yyyy* is more common in the **UK**.

Python has **strftime()** and **strptime()** methods to handle this.

## Python **strftime()** : Converts datetime object to string
The method creates a formatted string from a given date, datetime or time object.

In [32]:
# current date and time
now = datetime.datetime.now()

t = now.strftime("%H:%M:%S")
print("time:", t)

s1 = now.strftime("%m/%d/%Y, %H:%M:%S") #US format
# mm/dd/YY H:M:S format
print("USA:", s1)

s2 = now.strftime("%d/%m/%Y, %H:%M:%S")  #UK format
# dd/mm/YY H:M:S format
print("UK:", s2)

time: 22:03:23
USA: 09/06/2022, 22:03:23
UK: 06/09/2022, 22:03:23

Here, %Y, %m, %d, %H etc. are format codes. The strftime() method takes one or more format codes and returns a formatted string based on it.

In the above program, t, s1 and s2 are strings.

1. **%Y** - year [0001,..., 2018, 2019,..., 9999]
2. **%m** - month [01, 02, ..., 11, 12]
3. **%d** - day [01, 02, ..., 30, 31]
4. **%H** - hour [00, 01, ..., 22, 23
4. **%M** - minute [00, 01, ..., 58, 59]
6. **%S** - second [00, 01, ..., 58, 59]

### Extract the Year, Month, day and Time using **strftime()**

In [34]:
now = datetime.datetime.now() # current date and time

year = now.strftime("%Y")
print("year:", year)

month = now.strftime("%m")
print("month:", month)

day = now.strftime("%d")
print("day:", day)

time = now.strftime("%H:%M:%S")
print("time:", time)

date_time = now.strftime("%m/%d/%Y, %H:%M:%S")
print("date and time:",date_time)

year: 2022
month: 09
day: 06
time: 22:05:53
date and time: 09/06/2022, 22:05:53

Here, **year**, **day**, **time** and **date_time** are strings, whereas **now** is a datetime object.

### Creating string from a timestamp

In [36]:
timestamp = 789232321
date_time = datetime.datetime.fromtimestamp(timestamp)

print("Date time object:", date_time)

d = date_time.strftime("%m/%d/%Y, %H:%M:%S")
print("Output 2:", d)

d = date_time.strftime("%d %b, %Y")
print("Output 3:", d)

d = date_time.strftime("%d %B, %Y")
print("Output 4:", d)

d = date_time.strftime("%I%p")
print("Output 5:", d)

Date time object: 1995-01-04 18:12:01
Output 2: 01/04/1995, 18:12:01
Output 3: 04 Jan, 1995
Output 4: 04 January, 1995
Output 5: 06PM

## Python **strptime()** : Converts string to datetime
The strptime() method creates a datetime object from a given string (representing date and time).

In [37]:
date_string = "21 June, 2018"
print("date_string =", date_string)

date_object = datetime.datetime.strptime(date_string, "%d %B, %Y")
print("date_object =", date_object)

date_string = 21 June, 2018
date_object = 2018-06-21 00:00:00

By the way, %d, %B and %Y format codes are used for day, month(full name) and year respectively.

# **Handling Time Zones**

We can display time based on specific time zone. This helps when dealing with projects that require handling of data from different time zones. 

We will use the ***pytZ module*** to handle time zones

In [39]:
# !pip intsall pytz
import pytz

local = datetime.datetime.now()
print("Local:", local.strftime("%m/%d/%Y, %H:%M:%S"))


tz_Sydney = pytz.timezone('Australia/Sydney')
datetime_Sydney = datetime.datetime.now(tz_Sydney)
print("Sydney:", datetime_Sydney.strftime("%m/%d/%Y, %H:%M:%S"))

tz_NY = pytz.timezone('America/New_York') 
datetime_NY = datetime.datetime.now(tz_NY)
print("NY:", datetime_NY.strftime("%m/%d/%Y, %H:%M:%S"))

Local: 09/06/2022, 22:07:28
Sydney: 09/07/2022, 05:07:28
NY: 09/06/2022, 15:07:28

# **Get year, month, and day from a DataFrame**

***dt.year***, ***dt.month*** and ***dt.day*** are the inbuilt attributes to get year, month , and day from Pandas datetime object.

In [40]:
import pandas as pd

df = pd.DataFrame({'name': ['Ben', 'Simran', 'Sanjay'],
                 'DoB': ['08-05-1990', '04-28-1998', '12-16-2001']})
df['DoB'] = pd.to_datetime(df['DoB'])
df

     name        DoB
0     Ben 1990-08-05
1  Simran 1998-04-28
2  Sanjay 2001-12-16

In [42]:
df['year'] = df['DoB'].dt.year
df['month'] = df['DoB'].dt.month
df['day'] = df['DoB'].dt.day
df

     name        DoB  year  month  day
0     Ben 1990-08-05  1990      8    5
1  Simran 1998-04-28  1998      4   28
2  Sanjay 2001-12-16  2001     12   16

# **Assemble a datetime from multiple columns**

In [43]:
#Let's assemble the date
df['Date-Assembled'] = pd.to_datetime(df[['year','month','day']])

In [44]:
df

     name        DoB  year  month  day Date-Assembled
0     Ben 1990-08-05  1990      8    5     1990-08-05
1  Simran 1998-04-28  1998      4   28     1998-04-28
2  Sanjay 2001-12-16  2001     12   16     2001-12-16

# **Get the week of year, the day of week and leap year**

Similarly, ***dt.week***, ***dt.dayofweek***, and ***dt.is_leap_year*** are the inbuilt attributes to get the week of year, the day of week, and leap year.

In [49]:
df['week_of_year'] = df['DoB'].dt.week
df['day_of_week'] = df['DoB'].dt.dayofweek
df['is_leap_year'] = df['DoB'].dt.is_leap_year
df

,name,DoB,year,month,day,Date-Assembled,week_of_year,day_of_week,is_leap_year
0,Ben,1990-08-05,1990,8,5,1990-08-05,31,6,False
1,Simran,1998-04-28,1998,4,28,1998-04-28,18,1,False
2,Sanjay,2001-12-16,2001,12,16,2001-12-16,50,6,False

# **Map The Day Of The Weeks With Thier Proper Names**

In [50]:
dw_mapping={
    0: 'Monday', 
    1: 'Tuesday', 
    2: 'Wednesday', 
    3: 'Thursday', 
    4: 'Friday',
    5: 'Saturday', 
    6: 'Sunday'
} 
df['day_of_week_name']=df['DoB'].dt.weekday.map(dw_mapping)
df

,name,DoB,year,month,day,Date-Assembled,week_of_year,day_of_week,is_leap_year,day_of_week_name
0,Ben,1990-08-05,1990,8,5,1990-08-05,31,6,False,Sunday
1,Simran,1998-04-28,1998,4,28,1998-04-28,18,1,False,Tuesday
2,Sanjay,2001-12-16,2001,12,16,2001-12-16,50,6,False,Sunday

### Get the age from the date of birth

In [51]:
today = pd.to_datetime('today')

df['age'] = today.year - df['DoB'].dt.year
df

,name,DoB,year,month,day,Date-Assembled,week_of_year,day_of_week,is_leap_year,day_of_week_name,age
0,Ben,1990-08-05,1990,8,5,1990-08-05,31,6,False,Sunday,32
1,Simran,1998-04-28,1998,4,28,1998-04-28,18,1,False,Tuesday,24
2,Sanjay,2001-12-16,2001,12,16,2001-12-16,50,6,False,Sunday,21

# **Working With Dates In Pandas DataFrame**

In [66]:
df = pd.read_excel('../content/anonymous.xlsx')
df.head()

,Name,Area,Depot,Position,Hiring Date,Placement Date,Liberation Date,Exit Date
0,Kimberli Okelly,VideoGames,Puebla de Zaragoza,Nightshift Depot Hand,2017-01-23,2017-01-27 00:00:00,2017-01-29 00:00:00,NaT
1,Lavern Fuhrman,Books,Monterrey,Packer,2017-01-19,2017-01-30 00:00:00,2017-02-25 00:00:00,NaT
2,Ghislaine Bodie,Books,Ciudad de México,General Depot Hand,2017-01-27,2017-02-04 00:00:00,Exit,2017-01-29
3,Dianne Mayweather,Books,Monterrey,Package Reception,2017-02-11,2017-02-21 00:00:00,2017-03-21 00:00:00,NaT
4,Myron Gustavson,Clothes,Ciudad de México,Package Reception,2017-03-01,2017-03-13 00:00:00,2017-04-07 00:00:00,NaT

### Operations On Date In Pandas DataFrame

In [67]:
#Let's set Hiring Date as an Index for easier operations
df = df.set_index(['Hiring Date'])
df.head()

,Name,Area,Depot,Position,Placement Date,Liberation Date,Exit Date
Hiring Date,,,,,,,
2017-01-23,Kimberli Okelly,VideoGames,Puebla de Zaragoza,Nightshift Depot Hand,2017-01-27 00:00:00,2017-01-29 00:00:00,NaT
2017-01-19,Lavern Fuhrman,Books,Monterrey,Packer,2017-01-30 00:00:00,2017-02-25 00:00:00,NaT
2017-01-27,Ghislaine Bodie,Books,Ciudad de México,General Depot Hand,2017-02-04 00:00:00,Exit,2017-01-29
2017-02-11,Dianne Mayweather,Books,Monterrey,Package Reception,2017-02-21 00:00:00,2017-03-21 00:00:00,NaT
2017-03-01,Myron Gustavson,Clothes,Ciudad de México,Package Reception,2017-03-13 00:00:00,2017-04-07 00:00:00,NaT

### Which Employees were hired in 2017. How many are there?

In [64]:
df.loc['2017', ['Name','Area']].head()

                            Name        Area
Hiring Date
2017-01-23     Kimberli Okelly    VideoGames
2017-01-19      Lavern Fuhrman         Books
2017-01-27     Ghislaine Bodie         Books
2017-02-11   Dianne Mayweather         Books
2017-03-01     Myron Gustavson       Clothes

In [59]:
df.loc['2017', ['Name']].shape

(400, 1)

### Which employees were hired on 14th February 2017? Which Area are they? What is their Position?

In [61]:
df.loc['2017-02-14', ['Name','Area','Position']]

                      Name              Area            Position
Hiring Date
2017-02-14    Mia Slavin    Home and Kitchen              Packer
2017-02-14   Kala Kirwin    Home and Kitchen  General Depot Hand
2017-02-14     Ma Livers               Books   Forklift Operator

### Which guys were hired between January 27 and March 13, 2017? Which Depot were they and when did they exit?

In [63]:
df.loc['2017-01-27' : '2017-03-13', ['Name','Depot','Exit Date']].head()

                            Name             Depot  Exit Date
Hiring Date
2017-01-27     Ghislaine Bodie    Ciudad de México 2017-01-29
2017-02-11   Dianne Mayweather           Monterrey        NaT
2017-03-01     Myron Gustavson    Ciudad de México        NaT
2017-02-25     Maryjane Condie         Guadalajara        NaT
2017-02-15        Mirtha Knabe    Ciudad de México        NaT